In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [4]:
data.shape

(16044, 7)

In [5]:
data.dtypes

rental_id                int64
rental_date     datetime64[ns]
inventory_id             int64
customer_id              int64
return_date     datetime64[ns]
staff_id                 int64
last_update     datetime64[ns]
dtype: object

In [14]:
def rentals_month(engine, month, year):
    query = f'''
        SELECT *
        FROM rental
        WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}
    '''

    df = pd.read_sql_query(query, engine)
    
    return df

In [15]:
df = rentals_month(engine,5,2005)

print(df)

      rental_id         rental_date  inventory_id  customer_id  \
0             1 2005-05-24 22:53:30           367          130
1             2 2005-05-24 22:54:33          1525          459
2             3 2005-05-24 23:03:39          1711          408
3             4 2005-05-24 23:04:41          2452          333
4             5 2005-05-24 23:05:21          2079          222
...         ...                 ...           ...          ...
1151       1153 2005-05-31 21:36:44          2725          506
1152       1154 2005-05-31 21:42:09          2732           59
1153       1155 2005-05-31 22:17:11          2048          251
1154       1156 2005-05-31 22:37:34           460          106
1155       1157 2005-05-31 22:47:45          1449           61

             return_date  staff_id         last_update
0    2005-05-26 22:04:30         1 2006-02-15 21:30:53
1    2005-05-28 19:40:33         1 2006-02-15 21:30:53
2    2005-06-01 22:12:39         1 2006-02-15 21:30:53
3    2005-06-03 01:43:41         2 2006-02-15 21:30:53
4    2005-06-02 04:33:21         1 2006-02-15 21:30:53
...                  ...       ...                 ...
1151 2005-06-10 01:26:44         2 2006-02-15 21:30:53
1152 2005-06-08 16:40:09         1 2006-02-15 21:30:53
1153 2005-06-04 20:27:11         2 2006-02-15 21:30:53
1154 2005-06-01 23:02:34         2 2006-02-15 21:30:53
1155 2005-06-02 18:01:45         1 2006-02-15 21:30:53

[1156 rows x 7 columns]

In [26]:
print(df)

      rental_id         rental_date  inventory_id  customer_id  \
0             1 2005-05-24 22:53:30           367          130
1             2 2005-05-24 22:54:33          1525          459
2             3 2005-05-24 23:03:39          1711          408
3             4 2005-05-24 23:04:41          2452          333
4             5 2005-05-24 23:05:21          2079          222
...         ...                 ...           ...          ...
1151       1153 2005-05-31 21:36:44          2725          506
1152       1154 2005-05-31 21:42:09          2732           59
1153       1155 2005-05-31 22:17:11          2048          251
1154       1156 2005-05-31 22:37:34           460          106
1155       1157 2005-05-31 22:47:45          1449           61

             return_date  staff_id         last_update
0    2005-05-26 22:04:30         1 2006-02-15 21:30:53
1    2005-05-28 19:40:33         1 2006-02-15 21:30:53
2    2005-06-01 22:12:39         1 2006-02-15 21:30:53
3    2005-06-03 01:43:41         2 2006-02-15 21:30:53
4    2005-06-02 04:33:21         1 2006-02-15 21:30:53
...                  ...       ...                 ...
1151 2005-06-10 01:26:44         2 2006-02-15 21:30:53
1152 2005-06-08 16:40:09         1 2006-02-15 21:30:53
1153 2005-06-04 20:27:11         2 2006-02-15 21:30:53
1154 2005-06-01 23:02:34         2 2006-02-15 21:30:53
1155 2005-06-02 18:01:45         1 2006-02-15 21:30:53

[1156 rows x 7 columns]

In [33]:
def rental_count_month(rentals_month, month, year):
    rentals_filtered = rentals_month[(rentals_month['rental_date'].dt.month == month) & (rentals_month['rental_date'].dt.year == year)]
    rental_counts = rentals_filtered['customer_id'].value_counts().reset_index()
    rental_counts.columns = ['customer_id', f'rentals_{month:02d}_{year}']
    return rental_counts

In [34]:
counts = rental_count_month(df, 5, 2005)
print(counts)

     customer_id  rentals_05_2005
0            197                8
1            109                7
2            506                7
3            371                6
4            161                6
..           ...              ...
515          590                1
516          537                1
517          426                1
518          494                1
519           61                1

[520 rows x 2 columns]

In [37]:
data2 = pd.read_sql_query('SELECT * FROM customer', engine)
data2.head()

def create_date(engine, month, year):
    query = f'''
        SELECT *
        FROM customer
        WHERE MONTH(create_date) = {month} AND YEAR(create_date) = {year}
    '''

    df2 = pd.read_sql_query(query, engine)
    
    return df2

In [38]:
df2 = create_date(engine,2,2006)

print(df2)

     customer_id  store_id first_name  last_name  \
0              1         1       MARY      SMITH
1              2         1   PATRICIA    JOHNSON
2              3         1      LINDA   WILLIAMS
3              4         2    BARBARA      JONES
4              5         1  ELIZABETH      BROWN
..           ...       ...        ...        ...
594          595         1   TERRENCE  GUNDERSON
595          596         1    ENRIQUE   FORSYTHE
596          597         1    FREDDIE     DUGGAN
597          598         1       WADE   DELVALLE
598          599         2     AUSTIN    CINTRON

                                     email  address_id  active  \
0            MARY.SMITH@sakilacustomer.org           5       1
1      PATRICIA.JOHNSON@sakilacustomer.org           6       1
2        LINDA.WILLIAMS@sakilacustomer.org           7       1
3         BARBARA.JONES@sakilacustomer.org           8       1
4       ELIZABETH.BROWN@sakilacustomer.org           9       1
..                                     ...         ...     ...
594  TERRENCE.GUNDERSON@sakilacustomer.org         601       1
595    ENRIQUE.FORSYTHE@sakilacustomer.org         602       1
596      FREDDIE.DUGGAN@sakilacustomer.org         603       1
597       WADE.DELVALLE@sakilacustomer.org         604       1
598      AUSTIN.CINTRON@sakilacustomer.org         605       1

            create_date         last_update
0   2006-02-14 22:04:36 2006-02-15 04:57:20
1   2006-02-14 22:04:36 2006-02-15 04:57:20
2   2006-02-14 22:04:36 2006-02-15 04:57:20
3   2006-02-14 22:04:36 2006-02-15 04:57:20
4   2006-02-14 22:04:36 2006-02-15 04:57:20
..                  ...                 ...
594 2006-02-14 22:04:37 2006-02-15 04:57:20
595 2006-02-14 22:04:37 2006-02-15 04:57:20
596 2006-02-14 22:04:37 2006-02-15 04:57:20
597 2006-02-14 22:04:37 2006-02-15 04:57:20
598 2006-02-14 22:04:37 2006-02-15 04:57:20

[599 rows x 9 columns]

In [50]:
def compare_rentals(df, df2):
    merged_df = pd.merge(df, df2, on='customer_id', how='inner')
    merged_df['difference'] = merged_df['rental_id'] - merged_df['customer_id']
    merged_df.drop(['rental_id', 'rental_date', 'inventory_id', 'customer_id', 'return_date', 'staff_id', 'last_update_x', 'store_id', 'first_name', 'last_name', 'email', 'address_id', 'active', 'create_date', 'last_update_y'], axis=1, inplace=True)
    return merged_df

result = compare_rentals(df, df2)
print(result)

      difference
0           -129
1            616
2           -457
3           -405
4           -349
...          ...
1151         961
1152         786
1153        1130
1154        1014
1155        1096

[1156 rows x 1 columns]